/*!
  \file   help_gamma_hp.cpp
  \brief  Описание методики проверки платы высоковольтного питания гаммы
  \author Aleksey Lekhtin
  \date   created 15.08.2016
*/

#include "mainwindow.h"

//---------------------------------------------------------
//! Описание методики тестирования
// \return описание
//
QString MW::help__get_gamma_hp_methodology()
{
    QString text;
    text =
            "<h2>Методика тестирования\nплаты высоковольтного питания модуля 'гамма'</h2>"
            "\n"
            "<h3>Подключение оснастки</h3>"
            "<p>"
            "<img src=':q_ppe-3323_gamma_hp.png'>"
            "<img src=':q_funcshema_gamma_hp.png'>"
            "</p>"
            "<h3>Рабочие параметры платы</h3>"

            "<table border='0' cellspacing='0' cellpadding='0'>"
            "<tr><td> Номинальный диапазон вх.напряжения </td><td> 22 - 40В  </td></tr>"
            "<tr><td> Уставка (управляющее напряжение)   </td><td> 0 - 5.5В  </td></tr>"
            "<tr><td> Разрешение работы 'En''             </td><td> 5В (TTL)</td></tr>"
            "</table>\n"
            "<div><b>Внимание!!!<br>Присутствует высоковольтное напряжение до 2000 В</b></div>\n"

            "<table border='0' cellspacing='0' cellpadding='4'>"
            "<tr>"
            "<td> Выходное напряжение до делителя</td>"
            "<td> от -760В до -1800В</td></tr>"
            "<tr>"
            "<td> Выходное напряжение с делителя </td>"
            "<td> до -50В  </td></tr>"
            "<tr>"
            "<td> Точность установки высоковольтного напряжения </td>"
            "<td> ±80В </td></tr>"
            "<tr><td> Амплитуда пульсаций </td><td> 0.5В </td>"
            "</tr>"
            "<tr>"
            "<td> Номинальный ток потребления </td><td> 0.15А </td>"
            "</tr>"
            "</table>"
            "\n"
            "<h3>Подключения оснастки тестирования к плате</h3>"

            "<table border='0' cellspacing='0' cellpadding='4'>"
            "<tr>"
            "<td> Измерение напряжения питания</td>"
            "<td> &nbsp;-&nbsp; канал AI0 модуль NI9221 </td></tr>"
            "<tr>"
            "<td> Измерение высоковольтного напряжение (с делителя)</td>"
            "<td> &nbsp;-&nbsp; канал AI1 модуль NI9221 </td></tr>"
            "<tr>"
            "<td> Измерение напряжения уставки</td>"
            "<td> &nbsp;-&nbsp; канал AI2 модуль NI9221 </td></tr>"
            "<tr><td>&nbsp;</td></tr>"
            "<tr>"
            "<td> Подача напряжения включения 'En'</td>"
            "<td> &nbsp;-&nbsp; канал AO0 модуль NI9264 </td></tr>"
            "<tr>"
            "<td> Подача напряжения уставки </td>"
            "<td> &nbsp;-&nbsp; канал AO1 модуль NI9264 </td></tr>"
            "</table>\n"
            "\n"

            "<h3>Методика проведения испытаний</h3>\n"

            "&nbsp;1. Настроить источник питания PPE3323 на выходное напряжение 22В, "
            "выходной ток 100&nbsp;мА\n"
            "&nbsp;2. Подать на плату уставку 0 В\n"

            "&nbsp;3. Подать напряжение включения 'En' +5 В\n"
            "&nbsp;&nbsp; - На высоковольтном выходе ожидается -760 В (на делителе -11.65 В)\n"

            "&nbsp;4. Подать на плату уставку 2 В\n"
            "&nbsp;&nbsp; - На высоковольтном выходе ожидается -1200 В (на делителе -19.23 В)\n"

            "&nbsp;5. Подать на плату уставку 4 В\n"
            "&nbsp;&nbsp; - На высоковольтном выходе ожидается -1400 В (на делителе -25.70 В)\n"

            "&nbsp;6. Повторить п.2, п.4, п.5 с напряжением питания 26 В и 30 В\n"
            "&nbsp;7. Повторить п.2 - п.6 в печке при температурах 50-75-100-125С°."
            ;

    QString html = QString("<html><body>"
                           "<table border='0' cellspacing='0' style='margin:auto;' >"
                           "<tr><td>%1</td></tr>"
                           "</table><br></body></html>" ).arg( text );
    html.replace( "\n", "<br>\n" );
    return html;
}

//---------------------------------------------------------
//! Описание работы с приложением
// \return описание
//
QString MW::help__get_gamma_hp_userguide()
{
    QString text;
    text =
            "<h2>Руководство по тестированию\nплаты высоковольного питания модуля 'гамма'</h2>"
            "\n"
            "<h3>Подключение оснастки</h3>"
            "<p>"
            "<img src=':q_ppe-3323_gamma_hp.png' width='500' style='float:right;'>"
            "</p>"
            "<p>"
            "Программа тестирования управляет источником питания "
            "по последовательному порту RS232."
            "Опрос источника питания выполняется постоянно с целью отображения "
            "текущих параметров: установленного напряжения, "
            "выдаваемого напряжения и тока потребления. "
            "Программа-же подает в источник питания команды для установки необходимых "
            "напряжений и токовых ограничений."
            "</p>"
            "<p>"
            "Считываемые параметры с тестируемой платы отображаются в соответствующих "
            "полях форм и также на графиках."
            "</p>"
            "<p>"
            "Для тестирования платы есть два режима: ручной режим и автоматический."
            ""
            "<h4>Ручной режим</h4>"
            "В ручном режиме можно самостоятельно задавать подаваемые напряжения и "
            "сигналы управления, наблюдая выходные параметры платы."
            ""
            "<h4>Автоматический режим</h4>"
            "Перед началом тесирования запрашивается серийный номер "
            "тестируемой платы.\n"
            "В автоматическом режиме программа самостоятельно задает входные "
            "напряжения и сигналы согласно <i>Методики тестирования</i>.\n"
            "Выходные параметры платы отображаются в формах и графиках и "
            "фиксируются в протоколе испытания.\n"
            "По окончании тестирования формируется отчет, на котором приведены "
            "все режимы тесирования и сообщения о годности каждого контрольного "
            "параметра. Отчет можно распечатать."
            ""
            "<h3>Настройки</h3>"
            "<ul>"
            "<li><b>Последовательный порт</b>\n"
            "В настройках необходимо задать номер и параметры последовательного порта, "
            "к которому подключен управляемый источник питания."
            ""
            "<li><b>Отчет</b>\n"
            "Папка с отчетами определяет место хранения файлов с результатами тестирования. "
            "Для создания подкаталогов с именем даты для записи текущих отчетов "
            "используется параметр <i>Использовать дату для подкаталогов</i>."
            "</ul>"
            ""
            "<h3>cDAQmx</h3>"
            "<ul>"
            "<li><b>cDAQmx IP</b>\n"
            "определяет IP адрес, по которому работает контроллер "
            "с измерительными модулями."
            "Для определения адреса нужно обратиться к администратору локальной сети."
            "</ul>"
            ;

    QString html = QString("<html><body>"
                           "<table border='0' cellspacing='0' style='margin:auto;' >"
                           "<tr><td>%1</td></tr>"
                           "</table><br></body></html>" ).arg( text );
    html.replace( "\n", "<br>\n" );
    return html;
}
